Show / Hide Table of Contents
Class StandardCheckSection
Single check section
Inheritance
System.Object
OpenObject
OpenElementId
CheckSection
StandardCheckSection
Inherited Members
 CheckSection.Description
 CheckSection.CheckMember
 CheckSection.ReinfSection
 CheckSection.Extremes
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Concrete.SingleCheckProject.StandardSection,CI.SingleCheckProject", "CI.Services.Concrete.ServicePoint.ISingleCheckSection,CI.ServiceTypes", typeof(CheckSection))]
public class StandardCheckSection : CheckSection
Constructors
Improve this Doc   View Source
StandardCheckSection()
Constructor
Declaration
public StandardCheckSection()
 Improve this Doc
 View Source